In [1]:
# importing libraries 
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# reading the data 
df1 = pd.read_csv('GTD.csv' , encoding = 'latin1')

C:\Users\ujjwa\AppData\Local\Temp\ipykernel_1692\2118319152.py:2: DtypeWarning: Columns (4,6,31,33,61,62,63,76,79,90,92,94,96,114,115,121) have mixed types. Specify dtype option on import or set low_memory=False.
  df1 = pd.read_csv('GTD.csv' , encoding = 'latin1')

In [3]:
# head of the given dataset 
df1.head()

,eventid,iyear,imonth,iday,approxdate,extended,resolution,country,country_txt,region,...,addnotes,scite1,scite2,scite3,dbsource,INT_LOG,INT_IDEO,INT_MISC,INT_ANY,related
0,197000000001,1970,7,2,NaN,0,NaN,58,Dominican Republic,2,...,NaN,NaN,NaN,NaN,PGIS,0,0,0,0,NaN
1,197000000002,1970,0,0,NaN,0,NaN,130,Mexico,1,...,NaN,NaN,NaN,NaN,PGIS,0,1,1,1,NaN
2,197001000001,1970,1,0,NaN,0,NaN,160,Philippines,5,...,NaN,NaN,NaN,NaN,PGIS,-9,-9,1,1,NaN
3,197001000002,1970,1,0,NaN,0,NaN,78,Greece,8,...,NaN,NaN,NaN,NaN,PGIS,-9,-9,1,1,NaN
4,197001000003,1970,1,0,NaN,0,NaN,101,Japan,4,...,NaN,NaN,NaN,NaN,PGIS,-9,-9,1,1,NaN

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181691 entries, 0 to 181690
Columns: 135 entries, eventid to related
dtypes: float64(55), int64(22), object(58)
memory usage: 187.1+ MB

In [5]:
# after checking the data set we taking the worth columns from given data set 
# and rename them in readable and meanigfull Name .
df1.rename(columns= {'eventid':'Attack_id','iyear':'Year', 'imonth':'Month', 'iday':'Day','country_txt':'Country' ,'region_txt':'region_name','provstate':'State','attacktype1_txt':'attacktype','targtype1_txt':'Target_type','gname':'Group_Name','motive':'Motive','nkill':'kills','nwound':'Wounded','propcomment':'damage_&_loss'},inplace= True)

In [6]:
# createing the dataset as we fillterd 
df1 = df1 [['Attack_id','Year', 'Month', 'Day', 'Country','State','region','region_name','longitude','latitude' ,'attacktype', 'Target_type', 'Group_Name', 'Motive','summary','Wounded', 'kills', 'damage_&_loss']]

In [7]:
df1.shape

(181691, 18)

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181691 entries, 0 to 181690
Data columns (total 18 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Attack_id      181691 non-null  int64
 1   Year           181691 non-null  int64
 2   Month          181691 non-null  int64
 3   Day            181691 non-null  int64
 4   Country        181691 non-null  object
 5   State          181270 non-null  object
 6   region         181691 non-null  int64
 7   region_name    181691 non-null  object
 8   longitude      177134 non-null  float64
 9   latitude       177135 non-null  float64
 10  attacktype     181691 non-null  object
 11  Target_type    181691 non-null  object
 12  Group_Name     181691 non-null  object
 13  Motive         50561 non-null   object
 14  summary        115562 non-null  object
 15  Wounded        165380 non-null  float64
 16  kills          171378 non-null  float64
 17  damage_&_loss  57959 non-null   object
dtypes: float64(4), int64(5), object(9)
memory usage: 25.0+ MB

In [9]:
# decribe the all numrical values in dataframe 
df1.describe()

,Attack_id,Year,Month,Day,region,longitude,latitude,Wounded,kills
count,1.816910e+05,181691.000000,181691.000000,181691.000000,181691.000000,1.771340e+05,177135.000000,165380.000000,171378.000000
mean,2.002705e+11,2002.638997,6.467277,15.505644,7.160938,-4.586957e+02,23.498343,3.167668,2.403272
std,1.325957e+09,13.259430,3.388303,8.814045,2.933408,2.047790e+05,18.569242,35.949392,11.545741
min,1.970000e+11,1970.000000,0.000000,0.000000,1.000000,-8.618590e+07,-53.154613,0.000000,0.000000
25%,1.991021e+11,1991.000000,4.000000,8.000000,5.000000,4.545640e+00,11.510046,0.000000,0.000000
50%,2.009022e+11,2009.000000,6.000000,15.000000,6.000000,4.324651e+01,31.467463,0.000000,0.000000
75%,2.014081e+11,2014.000000,9.000000,23.000000,10.000000,6.871033e+01,34.685087,2.000000,2.000000
max,2.017123e+11,2017.000000,12.000000,31.000000,12.000000,1.793667e+02,74.633553,8191.000000,1570.000000

In [10]:
# converting all the null values to meadian 
df1['kills'] = df1['kills'].fillna(df1['kills'].median())

In [11]:
#also wounded 
df1['Wounded']= df1['Wounded'].fillna(df1['Wounded'].median())

In [12]:
#changing that float data types into int 

df1['kills'] = df1['kills'].astype(int)
df1['Wounded'] = df1['Wounded'].astype(int)

In [13]:
# create new column
df1["Casualty"] = df1['kills']+df1['Wounded']

In [14]:
df1.isnull().sum()

Attack_id             0
Year                  0
Month                 0
Day                   0
Country               0
State               421
region                0
region_name           0
longitude          4557
latitude           4556
attacktype            0
Target_type           0
Group_Name            0
Motive           131130
summary           66129
Wounded               0
kills                 0
damage_&_loss    123732
Casualty              0
dtype: int64

In [15]:
# hear we see the Motive summary and Damage& loss has the lot of null values 
# droping maximum null values columns from data frame 
df1.drop(columns = ['Motive','summary','damage_&_loss'],inplace = True)

In [16]:
df1.head(5)

,Attack_id,Year,Month,Day,Country,State,region,region_name,longitude,latitude,attacktype,Target_type,Group_Name,Wounded,kills,Casualty
0,197000000001,1970,7,2,Dominican Republic,NaN,2,Central America & Caribbean,-69.951164,18.456792,Assassination,Private Citizens & Property,MANO-D,0,1,1
1,197000000002,1970,0,0,Mexico,Federal,1,North America,-99.086624,19.371887,Hostage Taking (Kidnapping),Government (Diplomatic),23rd of September Communist League,0,0,0
2,197001000001,1970,1,0,Philippines,Tarlac,5,Southeast Asia,120.599741,15.478598,Assassination,Journalists & Media,Unknown,0,1,1
3,197001000002,1970,1,0,Greece,Attica,8,Western Europe,23.762728,37.997490,Bombing/Explosion,Government (Diplomatic),Unknown,0,0,0
4,197001000003,1970,1,0,Japan,Fukouka,4,East Asia,130.396361,33.580412,Facility/Infrastructure Attack,Government (Diplomatic),Unknown,0,0,0